Digilent/digilent-core/pic32/boards.txt
# new items
mega_pic32.platform=pic32
mega_pic32.build.board=_BOARD_MEGA_
mega_pic32.ccflags=ffff
mega_pic32.ldscript=chipKIT-application-32MX795F512.ld
# end of new items

mega_pic32.upload.protocol=stk500v2
mega_pic32.upload.maximum_size=520192
mega_pic32.upload.maximum_data_size=131072
mega_pic32.upload.speed=115200
mega_pic32.upload.tool=DigilentPGM

mega_pic32.bootloader.low_fuses=0xff
mega_pic32.bootloader.high_fuses=0xdd
mega_pic32.bootloader.extended_fuses=0x00
#mega_pic32.bootloader.path=not-supported
#mega_pic32.bootloader.file=not-supported
mega_pic32.bootloader.unlock_bits=0x3F
mega_pic32.bootloader.lock_bits=0x0F

mega_pic32.build.mcu=32MX795F512L
mega_pic32.build.f_cpu=80000000L
mega_pic32.build.core=pic32
mega_pic32.build.variant=Max32

############################################################
Digilent_OpenScope.name=Digilent OpenScope
Digilent_OpenScope.group=Digilent

# new items
Digilent_OpenScope.platform=pic32
Digilent_OpenScope.build.board=_BOARD_OPENSCOPE_
Digilent_OpenScope.ccflags=ffff
Digilent_OpenScope.ldscript=OpenScope.ld
# end of new items

Digilent_OpenScope.upload.protocol=stk500v2
Digilent_OpenScope.upload.maximum_size=2031616
Digilent_OpenScope.upload.maximum_data_size=524288
Digilent_OpenScope.upload.speed=115200

Digilent_OpenScope.bootloader.low_fuses=0xff
Digilent_OpenScope.bootloader.high_fuses=0xdd
Digilent_OpenScope.bootloader.extended_fuses=0x00
#Digilent_OpenScope.bootloader.path=not-supported
#Digilent_OpenScope.bootloader.file=not-supported
Digilent_OpenScope.bootloader.unlock_bits=0x3F
Digilent_OpenScope.bootloader.lock_bits=0x0F

Digilent_OpenScope.build.mcu=32MZ2048EFG124
Digilent_OpenScope.build.f_cpu=200000000UL
Digilent_OpenScope.build.core=pic32
Digilent_OpenScope.ldcommon=chipKIT-application-COMMON-MZ.ld
Digilent_OpenScope.build.variant=OpenScope
Digilent_OpenScope.build.ldscript.path={build.variant.path}

#Digilent_OpenScope.upload.using=avrdude1
Digilent_OpenScope.upload.tool=DigilentPGM
#Digilent_OpenScope.upload.tool=avrdude

############################################################

chipkit_uc32.name=chipKIT uC32
chipkit_uc32.group=chipKIT

# new items
chipkit_uc32.platform=pic32
chipkit_uc32.build.board=_BOARD_UC32_
chipkit_uc32.ccflags=ffff
chipkit_uc32.ldscript=chipKIT-application-32MX340F512.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
chipkit_uc32.compiler.c.extra_flags=-G1024
chipkit_uc32.compiler.cpp.extra_flags=-G1024
# end of new items

chipkit_uc32.upload.protocol=stk500v2
chipkit_uc32.upload.maximum_size=520192
chipkit_uc32.upload.maximum_data_size=32768
chipkit_uc32.upload.speed=115200
chipkit_uc32.upload.tool=DigilentPGM

chipkit_uc32.bootloader.low_fuses=0xff
chipkit_uc32.bootloader.high_fuses=0xdd
chipkit_uc32.bootloader.extended_fuses=0x00
#chipkit_uc32.bootloader.path=not-supported
#chipkit_uc32.bootloader.file=not-supported
chipkit_uc32.bootloader.unlock_bits=0x3F
chipkit_uc32.bootloader.lock_bits=0x0F

chipkit_uc32.build.mcu=32MX340F512H
chipkit_uc32.build.f_cpu=80000000L
chipkit_uc32.build.core=pic32
chipkit_uc32.build.variant=uC32

############################################################
############################################################
uc32_pmod.name=chipKIT uC32 with Pmod Shield
uc32_pmod.group=chipKIT

# new items
uc32_pmod.platform=pic32
uc32_pmod.build.board=_BOARD_UC32_
uc32_pmod.ccflags=ffff
uc32_pmod.ldscript=chipKIT-application-32MX340F512.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
uc32_pmod.compiler.c.extra_flags=-G1024
uc32_pmod.compiler.cpp.extra_flags=-G1024
# end of new items

uc32_pmod.upload.protocol=stk500v2
uc32_pmod.upload.maximum_size=520192
uc32_pmod.upload.maximum_data_size=32768
uc32_pmod.upload.speed=115200
uc32_pmod.upload.tool=DigilentPGM

uc32_pmod.bootloader.low_fuses=0xff
uc32_pmod.bootloader.high_fuses=0xdd
uc32_pmod.bootloader.extended_fuses=0x00
#uc32_pmod.bootloader.path=not-supported
#uc32_pmod.bootloader.file=not-supported
uc32_pmod.bootloader.unlock_bits=0x3F
uc32_pmod.bootloader.lock_bits=0x0F

uc32_pmod.build.mcu=32MX340F512H
uc32_pmod.build.f_cpu=80000000L
uc32_pmod.build.core=pic32
uc32_pmod.build.variant=uC32_Pmod_Shield

############################################################
############################################################
uno_pic32.name=chipKIT UNO32

# new items
uno_pic32.group=chipKIT
uno_pic32.platform=pic32
uno_pic32.build.board=_BOARD_UNO_
uno_pic32.ccflags=ffff
uno_pic32.ldscript=chipKIT-application-32MX320F128.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
uno_pic32.compiler.c.extra_flags=-G1024
uno_pic32.compiler.cpp.extra_flags=-G1024
# end of new items

uno_pic32.upload.protocol=stk500v2
uno_pic32.upload.maximum_size=126976
uno_pic32.upload.maximum_data_size=16384
uno_pic32.upload.speed=115200
uno_pic32.upload.tool=DigilentPGM


uno_pic32.bootloader.low_fuses=0xff
uno_pic32.bootloader.high_fuses=0xdd
uno_pic32.bootloader.extended_fuses=0x00
#uno_pic32.bootloader.path=not-supported
#uno_pic32.bootloader.file=not-supported
uno_pic32.bootloader.unlock_bits=0x3F
uno_pic32.bootloader.lock_bits=0x0F

uno_pic32.build.mcu=32MX320F128H
uno_pic32.build.f_cpu=80000000L
uno_pic32.build.core=pic32
uno_pic32.build.variant=Uno32

############################################################
############################################################
uno_pmod.name=chipKIT UNO32 with Pmod Shield
uno_pmod.group=chipKIT

# new items
uno_pmod.platform=pic32
uno_pmod.build.board=_BOARD_UNO_
uno_pmod.ccflags=ffff
uno_pmod.ldscript=chipKIT-application-32MX320F128.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
uno_pmod.compiler.c.extra_flags=-G1024
uno_pmod.compiler.cpp.extra_flags=-G1024
# end of new items

uno_pmod.upload.protocol=stk500v2
uno_pmod.upload.maximum_size=126976
uno_pmod.upload.maximum_data_size=16384
uno_pmod.upload.speed=115200
uno_pmod.upload.tool=DigilentPGM

uno_pmod.bootloader.low_fuses=0xff
uno_pmod.bootloader.high_fuses=0xdd
uno_pmod.bootloader.extended_fuses=0x00
#uno_pmod.bootloader.path=not-supported
#uno_pmod.bootloader.file=not-supported
uno_pmod.bootloader.unlock_bits=0x3F
uno_pmod.bootloader.lock_bits=0x0F

uno_pmod.build.mcu=32MX320F128H
uno_pmod.build.f_cpu=80000000L
uno_pmod.build.core=pic32
uno_pmod.build.variant=Uno32_Pmod_shield

############################################################
############################################################
chipkit_WF32.name=chipKIT WF32
chipkit_WF32.group=chipKIT

