Digilent/digilent-core/pic32/boards.txt
# new items
chipkit_WF32.platform=pic32
chipkit_WF32.build.board=_BOARD_WF32_
chipkit_WF32.ccflags=ffff
chipkit_WF32.ldscript=chipKIT-application-32MX695F512.ld
# end of new items

chipkit_WF32.upload.protocol=stk500v2
chipkit_WF32.upload.maximum_size=520192
chipkit_WF32.upload.maximum_data_size=131072
chipkit_WF32.upload.speed=115200
chipkit_WF32.upload.tool=DigilentPGM

chipkit_WF32.bootloader.low_fuses=0xff
chipkit_WF32.bootloader.high_fuses=0xdd
chipkit_WF32.bootloader.extended_fuses=0x00
#chipkit_WF32.bootloader.path=not-supported
#chipkit_WF32.bootloader.file=not-supported
chipkit_WF32.bootloader.unlock_bits=0x3F
chipkit_WF32.bootloader.lock_bits=0x0F

chipkit_WF32.build.mcu=32MX695F512L
chipkit_WF32.build.f_cpu=80000000L
chipkit_WF32.build.core=pic32
chipkit_WF32.build.variant=WF32
chipkit_WF32.build.ldscript.path={build.variant.path}

############################################################
############################################################
chipkit_WiFire.name=chipKIT WiFire(Rev C)
chipkit_WiFire.group=chipKIT

# new items
chipkit_WiFire.platform=pic32
chipkit_WiFire.build.board=_BOARD_WIFIRE_
chipkit_WiFire.ccflags=ffff
chipkit_WiFire.ldscript=MZ-application-32MZ2048ECX.ld
# end of new items

chipkit_WiFire.upload.protocol=stk500v2
chipkit_WiFire.upload.maximum_size=2080768
chipkit_WiFire.upload.maximum_data_size=524288
chipkit_WiFire.upload.speed=115200
chipkit_WiFire.upload.tool=DigilentPGM

chipkit_WiFire.bootloader.low_fuses=0xff
chipkit_WiFire.bootloader.high_fuses=0xdd
chipkit_WiFire.bootloader.extended_fuses=0x00
#chipkit_WiFire.bootloader.path=not-supported
#chipkit_WiFire.bootloader.file=not-supported
chipkit_WiFire.bootloader.unlock_bits=0x3F
chipkit_WiFire.bootloader.lock_bits=0x0F

chipkit_WiFire.build.mcu=32MZ2048EFG100
chipkit_WiFire.build.f_cpu=200000000UL
chipkit_WiFire.build.core=pic32
chipkit_WiFire.ldcommon=chipKIT-application-COMMON-MZ.ld
chipkit_WiFire.build.variant=WiFire
chipkit_WiFire.build.ldscript.path={build.variant.path}

############################################################
############################################################
Digilent_WiFIRE.name=Digilent WiFIRE(Rev D)
Digilent_WiFIRE.group=Digilent

# new items
Digilent_WiFIRE.platform=pic32
Digilent_WiFIRE.build.board=_BOARD_WIFIRE_
Digilent_WiFIRE.ccflags=ffff
Digilent_WiFIRE.ldscript=MZ-application-32MZ2048ECX.ld
# end of new items

Digilent_WiFIRE.upload.protocol=stk500v2
Digilent_WiFIRE.upload.maximum_size=2080768
Digilent_WiFIRE.upload.maximum_data_size=524288
Digilent_WiFIRE.upload.speed=115200
Digilent_WiFIRE.upload.tool=DigilentPGM

Digilent_WiFIRE.bootloader.low_fuses=0xff
Digilent_WiFIRE.bootloader.high_fuses=0xdd
Digilent_WiFIRE.bootloader.extended_fuses=0x00
#chipkit_WiFire.bootloader.path=not-supported
#chipkit_WiFire.bootloader.file=not-supported
Digilent_WiFIRE.bootloader.unlock_bits=0x3F
Digilent_WiFIRE.bootloader.lock_bits=0x0F

Digilent_WiFIRE.build.mcu=32MZ2048EFG100
Digilent_WiFIRE.build.f_cpu=200000000UL
Digilent_WiFIRE.build.core=pic32
Digilent_WiFIRE.ldcommon=chipKIT-application-COMMON-MZ.ld
Digilent_WiFIRE.build.variant=WiFire
Digilent_WiFIRE.build.ldscript.path={build.variant.path}

############################################################
############################################################
chipkit_WiFire_AB.name=chipKIT WiFire (RevA&B, No FPU)
chipkit_WiFire_AB.group=chipKIT

# new items
chipkit_WiFire_AB.platform=pic32
chipkit_WiFire_AB.build.board=_BOARD_WIFIRE_
chipkit_WiFire_AB.ccflags=ffff
chipkit_WiFire_AB.ldscript=MZ-application-32MZ2048ECX.ld
# end of new items

chipkit_WiFire_AB.upload.protocol=stk500v2
chipkit_WiFire_AB.upload.maximum_size=2080768
chipkit_WiFire_AB.upload.maximum_data_size=524288
chipkit_WiFire_AB.upload.speed=115200
chipkit_WiFire_AB.upload.tool=DigilentPGM

chipkit_WiFire_AB.bootloader.low_fuses=0xff
chipkit_WiFire_AB.bootloader.high_fuses=0xdd
chipkit_WiFire_AB.bootloader.extended_fuses=0x00
#chipkit_WiFire_AB.bootloader.path=not-supported
#chipkit_WiFire_AB.bootloader.file=not-supported
chipkit_WiFire_AB.bootloader.unlock_bits=0x3F
chipkit_WiFire_AB.bootloader.lock_bits=0x0F

chipkit_WiFire_AB.build.mcu=32MZ2048ECG100
chipkit_WiFire_AB.build.f_cpu=200000000UL
chipkit_WiFire_AB.build.core=pic32
chipkit_WiFire_AB.ldcommon=chipKIT-application-COMMON-MZ.ld
chipkit_WiFire_AB.build.variant=WiFire
chipkit_WiFire_AB.build.ldscript.path={build.variant.path}

############################################################


